docs/test-results/phase2/secondary/jfr-pinning-diagnostic/b1-normal-sse/k6.log
time="2026-08-19T23:53:20+09:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"maxDuration\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/user/Documents/GitHub/llm-concurrency-lab/load-test-k6/scenarios/01-concurrent-connections.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 40 iterations shared among 40 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m01.0s/10m0s  00/40 shared iters

running (00m02.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m02.0s/10m0s  00/40 shared iters

running (00m03.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m03.0s/10m0s  00/40 shared iters

running (00m04.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m04.0s/10m0s  00/40 shared iters

running (00m05.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m05.0s/10m0s  00/40 shared iters

running (00m06.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m06.0s/10m0s  00/40 shared iters

running (00m07.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 40 VUs  00m07.0s/10m0s  00/40 shared iters


  █ TOTAL RESULTS 

    CUSTOM
    client_events_received_total.....: 1440   181.868173/s
    client_stream_completed_total....: 40     5.051894/s
    client_stream_duration_seconds...: avg=7.91595 min=7.915 med=7.916 max=7.918 p(90)=7.917 p(95)=7.917
    client_ttfc_seconds..............: avg=1.0345  min=1.032 med=1.035 max=1.037 p(90)=1.036 p(95)=1.037
    sse_event........................: 1440   181.868173/s

    HTTP
    http_req_duration................: avg=7.91s   min=7.91s med=7.91s max=7.91s p(90)=7.91s p(95)=7.91s
    http_reqs........................: 40     5.051894/s

    EXECUTION
    iteration_duration...............: avg=7.91s   min=7.91s med=7.91s max=7.91s p(90)=7.91s p(95)=7.91s
    iterations.......................: 40     5.051894/s
    vus..............................: 40     min=40       max=40
    vus_max..........................: 40     min=40       max=40

    NETWORK
    data_received....................: 184 kB 23 kB/s
    data_sent........................: 11 kB  1.4 kB/s



running (00m07.9s), 00/40 VUs, 40 complete and 0 interrupted iterations
default ✓ [ 100% ] 40 VUs  00m07.9s/10m0s  40/40 shared iters